;= Question =============================================================================
;
; 問題 3.29
; 
; オアゲートのもう一つの構成法は, 合成ディジタル論理装置としてで, 
; アンドゲートとインバータで作る. これを達成する手続きor-gateを定義せよ. 
; このオアゲートの遅延時間はand-gate-delayとinverter-delayを使ってどの位か.
;
;= Prepared =============================================================================


;= Answer ===============================================================================

(define (or-gate o1 o2 output)
  (let ((inv-o1 (make-wire))
        (inv-o2 (make-wire))
        (inv-o3 (make-wire)))
       ((inverter o1 inv-o1)
        (inverter o2 inv-o2)
        (and-gate inv-o1 inv-o2 inv-o3)
        (inverter inv-o3 output))))

;= Test =================================================================================

