;= Question =============================================================================
;
; 問題 4.27
; 
; 次の定義を遅延評価器に入力したとする:
; 
; (define count 0)
; 
; (define (id x)
;   (set! count (+ count 1))
;     x)
; 
;     次の対話の例で欠けている値を補い, 答を説明せよ.38
; 
;     (define w (id (id 10)))
; 
;     ;;; L-Eval input:
;     count
;     ;;; L-Eval value:
;     ⟨応答⟩
; 
;     ;;; L-Eval input:
;     w
;     ;;; L-Eval value:
;     ⟨応答⟩
; 
;     ;;; L-Eval input:
;     count
;     ;;; L-Eval value:
;     ⟨応答⟩
; 
;= Prepared =============================================================================

(load "./eval.lazy.scm")

(evaluator)


;= Answer ===============================================================================
